In [2]:
import pandas as pd

In [4]:
x = pd.Series([1,2,3,4,5,6])
x

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [5]:
pd.Series(['a','b','c','d'])

0    a
1    b
2    c
3    d
dtype: object

In [10]:
x.index

RangeIndex(start=0, stop=6, step=1)

In [11]:
x

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [14]:
x[0]

1

In [16]:
x[4]

5

In [19]:
x[[0,2,1]]

0    1
2    3
1    2
dtype: int64

In [22]:
x[0]=0
x

0    0
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [6]:
y = pd.Series([1,2,3,4,5,6], index=['a','b','c','d','e','f'])
y

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [7]:
z = pd.Series([1,2,3,4,5], index=['a','b','c','e','d'])   
z

a    1
b    2
c    3
e    4
d    5
dtype: int64

In [3]:
xx = pd.Series([3,4,5,6,7,8,9],index =['a','b','c','d','f','g','h'])
xx

a    3
b    4
c    5
d    6
f    7
g    8
h    9
dtype: int64

In [28]:
y['a']

1

In [32]:
y[['a','d','e']]

a    1
d    4
e    5
dtype: int64

In [34]:
z[['a','b','c']]

a    1
b    2
c    3
dtype: int64

In [36]:
y + 2

a    3
b    4
c    5
d    6
e    7
f    8
dtype: int64

In [37]:
y*2

a     2
b     4
c     6
d     8
e    10
f    12
dtype: int64

In [38]:
y

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [39]:
y * 3

a     3
b     6
c     9
d    12
e    15
f    18
dtype: int64

In [41]:
y > 3

a    False
b    False
c    False
d     True
e     True
f     True
dtype: bool

In [42]:
y[y>3]

d    4
e    5
f    6
dtype: int64

In [44]:
z = pd.Series({'apple':10,'banana':20,'orange':20,'peach':60}) #z=pd.Serirs()
z

apple     10
banana    20
orange    20
peach     60
dtype: int64

In [47]:
z[z> 40].index.to_list()   #z[z>40].index.to_list()

['peach']

In [51]:
z[z>=20].index.to_list()  #z[z>=20].index.to_list() #z[z>=20].index.to_list() #z[z>=20].index.to_list()

['banana', 'orange', 'peach']

In [53]:
z[z>=20].index  #z[z>=20].index

Index(['banana', 'orange', 'peach'], dtype='object')

In [54]:
z.index #z.index #z.index

Index(['apple', 'banana', 'orange', 'peach'], dtype='object')

In [57]:
z.index = [0,1,2,3] #z.index =[0,1,2,3] #z.index=[0,1,2,3]

In [58]:
z

0    10
1    20
2    20
3    60
dtype: int64

In [62]:
z.unique()

array([10, 20, 60], dtype=int64)

## DataFrame

In [8]:
#字典方式建立DataFrame
data1 = {'name': ['Alan', 'Bob', 'Connie', 'Daniel', 'Ella'],
        'age': [23, 30, 38, 27, 45],
        'sex': ['M', 'M', 'F', 'M', 'F']}
df1 = pd.DataFrame(data1)
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [9]:
df1 = pd.DataFrame( {'name': ['Alan', 'Bob', 'Connie', 'Daniel', 'Ella'],
        'age': [23, 30, 38, 27, 45],
        'sex': ['M', 'M', 'F', 'M', 'F']})
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [24]:
data2 = {'name':['Joe', 'Kidd', 'Alison', 'Bod'],
        'age':[14,16,49,58],
        'sex':['M','F','M','F']}
df2=pd.DataFrame(data2)
df2

     name  age sex
0     Joe   14   M
1    Kidd   16   F
2  Alison   49   M
3     Bod   58   F

In [7]:
#先用大list 再命名 columns

data3 = [['Alan Chen', 23, 'M'], 
         ['Bob Yeh', 30, 'M'],
         ['Connie Ho', 38, 'F'],
         ['Daniel Chang', 27, 'M'],
         ['Ella Hsu', 45, 'F']]
df3 = pd.DataFrame(data3, columns=['name', 'age', 'sex'])
df3

           name  age sex
0     Alan Chen   23   M
1       Bob Yeh   30   M
2     Connie Ho   38   F
3  Daniel Chang   27   M
4      Ella Hsu   45   F

In [8]:
data4 = [['Allen',23, 'M'],
        ['Mary',18,'F'],
        ['King',22, 'M'],
        ['Bob',33, 'M'],
        ['Connie',33, 'M']]
df4 = pd.DataFrame(data4, columns=['Name','Age','Sex'])
df4

     Name  Age Sex
0   Allen   23   M
1    Mary   18   F
2    King   22   M
3     Bob   33   M
4  Connie   33   M

In [76]:
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [73]:
df1.columns #df1.columns , df1.columns

Index(['name', 'age', 'sex'], dtype='object')

In [79]:
df1.index #df1.index ,df1=index, df1=index

RangeIndex(start=0, stop=5, step=1)

In [80]:
df1.values  #df1.values,#df1.values

array([['Alan', 23, 'M'],
       ['Bob', 30, 'M'],
       ['Connie', 38, 'F'],
       ['Daniel', 27, 'M'],
       ['Ella', 45, 'F']], dtype=object)

In [14]:
df1['name'] #Series 形態

0      Alan
1       Bob
2    Connie
3    Daniel
4      Ella
Name: name, dtype: object

In [13]:
df1[['name','age']]

     name  age
0    Alan   23
1     Bob   30
2  Connie   38
3  Daniel   27
4    Ella   45

In [94]:
df1.name

0      Alan
1       Bob
2    Connie
3    Daniel
4      Ella
Name: name, dtype: object

In [92]:
df1[['name']]#DataFrame 形態

     name
0    Alan
1     Bob
2  Connie
3  Daniel
4    Ella

In [96]:
df1[['name','age']]

     name  age
0    Alan   23
1     Bob   30
2  Connie   38
3  Daniel   27
4    Ella   45

In [98]:
df1[['age','sex']]

   age sex
0   23   M
1   30   M
2   38   F
3   27   M
4   45   F

In [113]:
df1[:3] #叫前三個index資料 #df1[:3] df1[:3]

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F

In [114]:
df1[:3]['name'] #df1[:3]['name'] df1[:3]

0      Alan
1       Bob
2    Connie
Name: name, dtype: object

In [110]:
df1[3:][['name']] #df1[3:]['name']

     name
3  Daniel
4    Ella

In [111]:
df1[2:5] #df1[2:5]

     name  age sex
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [20]:
df1['name'][:3]

0      Alan
1       Bob
2    Connie
Name: name, dtype: object

In [23]:
df1[['name']][2:4]

     name
2  Connie
3  Daniel

In [21]:
df1[['name']][:3]

     name
0    Alan
1     Bob
2  Connie

In [120]:
df1 == 'F'

    name    age    sex
0  False  False  False
1  False  False  False
2  False  False   True
3  False  False  False
4  False  False   True

In [17]:
df1['sex'] =='F'

0    False
1    False
2     True
3    False
4     True
Name: sex, dtype: bool

In [16]:
df1[['sex']]=='F'

     sex
0  False
1  False
2   True
3  False
4   True

In [18]:
df1[df1['sex']=='F'] #df1[df1['sex']=='F']

     name  age sex
2  Connie   38   F
4    Ella   45   F

In [21]:
df1[df1['sex']=='F']['age']#下圖為圖表表現方式

2    38
4    45
Name: age, dtype: int64

In [20]:
df1[df1['sex']=='F'][['age']] #df1[df1['sex']==' F']['age']

   age
2   38
4   45

In [19]:
df1[df1['sex']=='F']['name'] #df1[df1['sex']='F']['name']

2    Connie
4      Ella
Name: name, dtype: object

In [17]:
df1[df1['sex']=='F']['name'].to_list() #df1[df1['sex']=='F']['name'].to_list()

['Connie', 'Ella']

In [25]:
df1[df1['sex'] =='M']['name']

0      Alan
1       Bob
3    Daniel
Name: name, dtype: object

In [36]:
df1[df1['name']=='Alan']['age']

0    23
Name: age, dtype: int64

In [37]:
df1[df1['name']=='Bob']['sex']

1    M
Name: sex, dtype: object

In [38]:
df1[df1['sex']=='M']

     name  age sex
0    Alan   23   M
1     Bob   30   M
3  Daniel   27   M

In [39]:
df1['sex']=='M'

0     True
1     True
2    False
3     True
4    False
Name: sex, dtype: bool

## Info

In [40]:
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [46]:
df1.head(3) #head()如為空格的話，則呈現最前5列df1.head(),df1.head(),df1.head()

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F

In [47]:
df1.tail(2)#呈現從尾巴算來的第幾筆，如為空格的話，則呈現最後5列 df1.tail(),df1.tail(),df1.tail(),df1.tail()

     name  age sex
3  Daniel   27   M
4    Ella   45   F

In [49]:
df1.info() #df1.info(),df1.info(),df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   sex     5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [22]:
df1.describe()#count = 筆數， mean =平均值 ，std =標準差 ，25%落在什麼數字，50%落在什麼數字，75%落在什麼數字

             age
count   5.000000
mean   32.600000
std     8.848729
min    23.000000
25%    27.000000
50%    30.000000
75%    38.000000
max    45.000000

In [54]:
df2.describe()

             age
count   4.000000
mean   34.250000
std    22.544401
min    14.000000
25%    15.500000
50%    32.500000
75%    51.250000
max    58.000000

In [57]:
df1[['name','sex']].describe() #top為顯示最常出現的那筆。#freq為出現的次數 此為文字的部份。 #df1[['name','sex']].describe()

        name sex
count      5   5
unique     5   2
top     Alan   M
freq       1   3

In [58]:
df1[['name','sex']] #df1[['name','sex']]

     name sex
0    Alan   M
1     Bob   M
2  Connie   F
3  Daniel   M
4    Ella   F

## Remove column

In [33]:
df2.drop('age', axis=1) #row = 0; column =1 。只是呈現，如要取代的話，就要用等於 df2.drop('age',axis=1)

     name sex
0     Joe   M
1    Kidd   F
2  Alison   M
3     Bod   F

In [61]:
del df2['age'] #用del就會取代 #del df2['age']

In [62]:
df2

     name sex
0     Joe   M
1    Kidd   F
2  Alison   M
3     Bod   F

## iloc

In [ ]:
#iloc 用index找

In [66]:
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [40]:
df2.index=['a','b','c','d']
df2

     name  age sex
a     Joe   14   M
b    Kidd   16   F
c  Alison   49   M
d     Bod   58   F

In [45]:
df2.iloc[0] #既使index是英文字，還是要用數字找

name    Joe
age      14
sex       M
Name: a, dtype: object

In [35]:
df1.iloc[0] #列出index 為0的row

name    Alan
age       23
sex        M
Name: 0, dtype: object

In [72]:
df1.iloc[3] #列出index 為3的row

name    Daniel
age         27
sex          M
Name: 3, dtype: object

In [73]:
df1.iloc[0,0] #先row 再column df1.iloc[0,0]

'Alan'

In [37]:
df1.iloc[0,1] #先row 再column

23

In [47]:
df1.iloc[:,1] #df1.iloc[:,1]

0    23
1    30
2    38
3    27
4    45
Name: age, dtype: int64

In [48]:
df1.iloc[:,2]

0    M
1    M
2    F
3    M
4    F
Name: sex, dtype: object

In [51]:
df1.iloc[2,:]

name    Connie
age         38
sex          F
Name: 2, dtype: object

In [53]:
df2.iloc[2,:]

name    Alison
age         49
sex          M
Name: c, dtype: object

In [80]:
df1.iloc[1]

name    Bob
age      30
sex       M
Name: 1, dtype: object

In [82]:
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [55]:
df1.iloc[:3,0]#叫多個資料

0      Alan
1       Bob
2    Connie
Name: name, dtype: object

In [83]:
df1.iloc[0,1:]#叫多個資料

age    23
sex     M
Name: 0, dtype: object

In [84]:
df1.iloc[[0,2,4],0] #多rows 一個column

0      Alan
2    Connie
4      Ella
Name: name, dtype: object

In [56]:
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [85]:
df1.iloc[[4,2,4],[0,2]]#多rows 多columns #df1.iloc[[4,2,4],[0,2]]

     name sex
4    Ella   F
2  Connie   F
4    Ella   F

## loc

In [ ]:
#用名稱來挑選

In [86]:
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [87]:
df1.loc[:,'name']

0      Alan
1       Bob
2    Connie
3    Daniel
4      Ella
Name: name, dtype: object

In [88]:
df1.loc[:,['name','sex']]

     name sex
0    Alan   M
1     Bob   M
2  Connie   F
3  Daniel   M
4    Ella   F

In [91]:
df1.loc[2:,['name','sex']] #row之所以為數字是因為row的index現為數字

     name sex
2  Connie   F
3  Daniel   M
4    Ella   F

In [92]:
df1.index =['a','b','c','e','f']

In [93]:
df1

     name  age sex
a    Alan   23   M
b     Bob   30   M
c  Connie   38   F
e  Daniel   27   M
f    Ella   45   F

In [99]:
df1.loc[['a','b','c'],['name','age']]

     name  age
a    Alan   23
b     Bob   30
c  Connie   38

In [100]:
df1.loc[:'d',['name','age']]

     name  age
a    Alan   23
b     Bob   30
c  Connie   38

In [101]:
df1

     name  age sex
a    Alan   23   M
b     Bob   30   M
c  Connie   38   F
e  Daniel   27   M
f    Ella   45   F

In [60]:
df1.loc[df1.sex=='F']

     name  age sex
2  Connie   38   F
4    Ella   45   F

In [57]:
df1.loc[df1.age >30]

     name  age sex
2  Connie   38   F
4    Ella   45   F

In [62]:
df1.loc[df1.age<30]

     name  age sex
0    Alan   23   M
3  Daniel   27   M

In [111]:
df1.loc[df1.age >30]

     name  age sex
c  Connie   38   F
f    Ella   45   F

In [115]:
df1.loc[df1.age > 30, ['name','sex']] #大於30 然後找name跟sex #df1.loc[df1.age >30,['name','sex']]

     name sex
c  Connie   F
f    Ella   F

In [114]:
df1.loc[df1.sex == 'F',['name','age']] #df1.loc[df1.sex =='F',['name','sex']]

     name  age
c  Connie   38
f    Ella   45

In [109]:
df1.loc[df1.sex =='F']

     name  age sex
c  Connie   38   F
f    Ella   45   F

In [116]:
df1.loc[df1.age > 30,'age'] =99#年紀大於30 然後取代成99歲

In [63]:
df2

     name  age sex
a     Joe   14   M
b    Kidd   16   F
c  Alison   49   M
d     Bod   58   F

In [65]:
df2.loc[df2.age>16,'age']=66
df2

     name  age sex
a     Joe   14   M
b    Kidd   16   F
c  Alison   66   M
d     Bod   66   F

In [74]:
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

## math

In [73]:
df1.max()

name    Ella
age       45
sex        M
dtype: object

In [72]:
df1.min()

name    Alan
age       23
sex        F
dtype: object

In [123]:
df1.mean()#平均值

<ipython-input-123-00fb6bfec183>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df1.mean()

age    55.6
dtype: float64

In [77]:
df1.sum()

163

In [78]:
df1.sum()['age']

163

In [79]:
df1.sum()['name']

'AlanBobConnieDanielElla'

In [84]:
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [86]:
df1.cumsum()#累加

                      name  age    sex
0                     Alan   23      M
1                  AlanBob   53     MM
2            AlanBobConnie   91    MMF
3      AlanBobConnieDaniel  118   MMFM
4  AlanBobConnieDanielElla  163  MMFMF

In [85]:
df1.cumsum()[['age']]

   age
0   23
1   53
2   91
3  118
4  163

## str

In [128]:
df1['sex'].str.replace('M','Male') #如沒指定欄位的話，會套用到整個表格。#df1['sex'].str.replace('M','Male')

a    Male
b    Male
c       F
e    Male
f       F
Name: sex, dtype: object

In [129]:
df1['sex']=df1['sex'].str.replace('M','Male')#這樣才有取代

In [130]:
df1

     name  age   sex
a    Alan   23  Male
b     Bob   30  Male
c  Connie   99     F
e  Daniel   27  Male
f    Ella   99     F

In [152]:
data1 = {'name': ['Alan', 'Bob', 'Connie', 'Daniel', 'Ella'],
        'age': [23, 30, 38, 27, 45],
        'sex': ['M', 'M', 'F', 'M', 'F']}
df1 = pd.DataFrame(data1)
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [153]:
df1.index =['a','b','c','d','f']
df1

     name  age sex
a    Alan   23   M
b     Bob   30   M
c  Connie   38   F
d  Daniel   27   M
f    Ella   45   F

In [154]:
df1=df1['sex'].str.replace('F','female')

In [147]:
df1

a         M
b         M
c    female
d         M
f    female
Name: sex, dtype: object

In [155]:
data1 = {'name': ['Alan', 'Bob', 'Connie', 'Daniel', 'Ella'],
        'age': [23, 30, 38, 27, 45],
        'sex': ['M', 'M', 'F', 'M', 'F']}
df1 = pd.DataFrame(data1)
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [156]:
df1['name'].str.lower()

0      alan
1       bob
2    connie
3    daniel
4      ella
Name: name, dtype: object

In [157]:
df1['name'].str.upper()

0      ALAN
1       BOB
2    CONNIE
3    DANIEL
4      ELLA
Name: name, dtype: object

In [164]:
df1['name'].str.upper()

0      ALAN
1       BOB
2    CONNIE
3    DANIEL
4      ELLA
Name: name, dtype: object

In [159]:
df1['name'].str.startswith('A')

0     True
1    False
2    False
3    False
4    False
Name: name, dtype: bool

In [161]:
df1[df1['name'].str.startswith('A')]

   name  age sex
0  Alan   23   M

In [165]:
df3

           name  age sex
0     Alan Chen   23   M
1       Bob Yeh   30   M
2     Connie Ho   38   F
3  Daniel Chang   27   M
4      Ella Hsu   45   F

In [167]:
df3['name'].str.split(' ')

0       [Alan, Chen]
1         [Bob, Yeh]
2       [Connie, Ho]
3    [Daniel, Chang]
4        [Ella, Hsu]
Name: name, dtype: object

In [170]:
df3['name'].str.split(' ',expand =True)#加上了expand =True 自動分成兩個欄位

        0      1
0    Alan   Chen
1     Bob    Yeh
2  Connie     Ho
3  Daniel  Chang
4    Ella    Hsu

In [171]:
df3['name'].str.split(' ',expand =True)[1]#篩選

0     Chen
1      Yeh
2       Ho
3    Chang
4      Hsu
Name: 1, dtype: object

In [172]:
df1['name'].str.contains('n')#contains 為包含有什麼的意思，此例為名字內包含有n

0     True
1    False
2     True
3     True
4    False
Name: name, dtype: bool

In [173]:
df1[df1['name'].str.contains('n')]#包回list中顯示出資料來

     name  age sex
0    Alan   23   M
2  Connie   38   F
3  Daniel   27   M

## apply

In [3]:
import pandas as pd
data1 = {'name': ['Alan', 'Bob', 'Connie', 'Daniel', 'Ella'],
        'age': [23, 30, 38, 27, 45],
        'sex': ['M', 'M', 'F', 'M', 'F']}
df1 = pd.DataFrame(data1)
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [5]:
df1['age'].apply(lambda x: '%.1f' %x)

0    23.0
1    30.0
2    38.0
3    27.0
4    45.0
Name: age, dtype: object

In [6]:
def f(series):
    return series -5

In [7]:
df1['age'].apply(f)

0    18
1    25
2    33
3    22
4    40
Name: age, dtype: int64

## sort

In [9]:
data5 = [[12,23,3,34,65],
        [65,19,28,39,10],
        [11,19,13,34,1]]
df5 =pd.DataFrame(data5, columns=['d','a','c','e','b'], index=['banana','apple','orange'])
df5

         d   a   c   e   b
banana  12  23   3  34  65
apple   65  19  28  39  10
orange  11  19  13  34   1

In [11]:
df5.sort_index() #括號內為ascending=True 由a排到z 排row

         d   a   c   e   b
apple   65  19  28  39  10
banana  12  23   3  34  65
orange  11  19  13  34   1

In [14]:
df5.sort_index(ascending = False) #由z排到a 排row

         d   a   c   e   b
orange  11  19  13  34   1
banana  12  23   3  34  65
apple   65  19  28  39  10

In [15]:
df5.sort_index(axis=1) #由a排到z  排column

         a   b   c   d   e
banana  23  65   3  12  34
apple   19  10  28  65  39
orange  19   1  13  11  34

In [17]:
df5.sort_index(axis=1, ascending = False)

         e   d   c   b   a
banana  34  12   3  65  23
apple   39  65  28  10  19
orange  34  11  13   1  19

In [19]:
df5.sort_values(by='a') #因為是value 加by=a 所以是由 a排序 (內建小到大)

         d   a   c   e   b
apple   65  19  28  39  10
orange  11  19  13  34   1
banana  12  23   3  34  65

df5.sort_values(by=['a','b'], ascending = False) #排完a 若a有一樣再從b去排

In [23]:
df5.sort_values(by='a', ascending = False)

         d   a   c   e   b
banana  12  23   3  34  65
apple   65  19  28  39  10
orange  11  19  13  34   1

## rank

In [25]:
df5

         d   a   c   e   b
banana  12  23   3  34  65
apple   65  19  28  39  10
orange  11  19  13  34   1

In [24]:
df5.rank() #照各個column 去排名次

          d    a    c    e    b
banana  2.0  3.0  1.0  1.5  3.0
apple   3.0  1.5  3.0  3.0  2.0
orange  1.0  1.5  2.0  1.5  1.0

In [26]:
df5.rank(ascending = False)#大到小

          d    a    c    e    b
banana  2.0  1.0  3.0  2.5  1.0
apple   1.0  2.5  1.0  1.0  2.0
orange  3.0  2.5  2.0  2.5  3.0

In [28]:
df5.rank(method ='min') # 1.0

          d    a    c    e    b
banana  2.0  3.0  1.0  1.0  3.0
apple   3.0  1.0  3.0  3.0  2.0
orange  1.0  1.0  2.0  1.0  1.0

In [29]:
df5.rank(method = 'max') #2.0

          d    a    c    e    b
banana  2.0  3.0  1.0  2.0  3.0
apple   3.0  2.0  3.0  3.0  2.0
orange  1.0  2.0  2.0  2.0  1.0

In [30]:
df5.rank(method = 'first')# 先看到哪個row 先排第名 雖然兩cloumn資料相同

          d    a    c    e    b
banana  2.0  3.0  1.0  1.0  3.0
apple   3.0  1.0  3.0  3.0  2.0
orange  1.0  2.0  2.0  2.0  1.0

## value_counts

In [31]:
df1

     name  age sex
0    Alan   23   M
1     Bob   30   M
2  Connie   38   F
3  Daniel   27   M
4    Ella   45   F

In [36]:
df1['sex'].value_counts().sort_values() #看value 的出現次數總合(數字、字串皆可)  可再接排序

F    2
M    3
Name: sex, dtype: int64

In [33]:
df1['name'].value_counts()

Alan      1
Bob       1
Connie    1
Daniel    1
Ella      1
Name: name, dtype: int64

In [35]:
df1['age'].value_counts()

23    1
30    1
38    1
27    1
45    1
Name: age, dtype: int64

## groupyby

In [37]:
data6 = {'Name':['Alan', 'Bob', 'Connie', 'Daniel', 'Ella'],
        'Age':[23,30,38,27,45],
        'Sex':['M', 'M', 'F', 'M', 'F'],
        'Dept':[1,1,1,2,2]}
df6=pd.DataFrame(data6)
df6

     Name  Age Sex  Dept
0    Alan   23   M     1
1     Bob   30   M     1
2  Connie   38   F     1
3  Daniel   27   M     2
4    Ella   45   F     2

In [39]:
 df6.groupby('Sex').count() #欄位的value 相同的併在一起 再算次數

     Name  Age  Dept
Sex
F       2    2     2
M       3    3     3

In [40]:
df6.groupby('Age').count()

     Name  Sex  Dept
Age
23      1    1     1
27      1    1     1
30      1    1     1
38      1    1     1
45      1    1     1

In [42]:
df6.groupby('Sex').mean() #姓別分出來後，再去看每個column的平均

           Age      Dept
Sex
F    41.500000  1.500000
M    26.666667  1.333333

In [43]:
df6.groupby('Sex').min()

       Name  Age  Dept
Sex
F    Connie   38     1
M      Alan   23     1

In [44]:
df6.groupby('Sex').sum()

     Age  Dept
Sex
F     83     3
M     80     4

In [45]:
df6.groupby('Sex').prod()#所有數字乖一起

       Age  Dept
Sex
F     1710     2
M    18630     2

In [49]:
df6.groupby('Sex').std()#標準差

          Age      Dept
Sex
F    4.949747  0.707107
M    3.511885  0.577350

In [50]:
df6.groupby('Sex').var()

           Age      Dept
Sex
F    24.500000  0.500000
M    12.333333  0.333333

In [55]:
df6.groupby(['Sex','Dept']).count()

          Name  Age
Sex Dept
F   1        1    1
    2        1    1
M   1        2    2
    2        1    1

In [60]:
df6.groupby(['Sex','Dept']).count()[['Name']]#只顯示name

          Name
Sex Dept
F   1        1
    2        1
M   1        2
    2        1

In [61]:
df6.groupby(['Sex','Dept']).count()[['Name','Age']]

          Name  Age
Sex Dept
F   1        1    1
    2        1    1
M   1        2    2
    2        1    1

In [63]:
df6.groupby(['Sex','Dept'],as_index=False).count()

  Sex  Dept  Name  Age
0   F     1     1    1
1   F     2     1    1
2   M     1     2    2
3   M     2     1    1

In [62]:
df6.groupby(['Sex','Dept']).count()[['Name']].rename(columns={'Name':'Count'}) #把名字變count

          Count
Sex Dept
F   1         1
    2         1
M   1         2
    2         1

In [58]:
df6.groupby(['Sex','Dept']).mean()

           Age
Sex Dept
F   1     38.0
    2     45.0
M   1     26.5
    2     27.0

In [65]:
df6.groupby(['Sex', 'Dept']).agg(['mean','std']) #agg可同時做多個動作

           Age
          mean       std
Sex Dept
F   1     38.0       NaN
    2     45.0       NaN
M   1     26.5  4.949747
    2     27.0       NaN

In [66]:
df6.groupby(['Sex','Dept']).agg([('Age', 'mean'),('Name', 'count')]) #做年紀平均，也個名字次數

           Age
           Age Name
Sex Dept
F   1     38.0    1
    2     45.0    1
M   1     26.5    2
    2     27.0    1

In [67]:
df6.groupby(['Sex','Dept']).describe()

           Age
         count  mean       std   min    25%   50%    75%   max
Sex Dept
F   1      1.0  38.0       NaN  38.0  38.00  38.0  38.00  38.0
    2      1.0  45.0       NaN  45.0  45.00  45.0  45.00  45.0
M   1      2.0  26.5  4.949747  23.0  24.75  26.5  28.25  30.0
    2      1.0  27.0       NaN  27.0  27.00  27.0  27.00  27.0